Revit 2027 API
IntersectingElementData.IntersectedElementId Property
 Id of the intersected element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId IntersectedElementId { get; }
Public ReadOnly Property IntersectedElementId As ElementId
	Get
public:
property ElementId^ IntersectedElementId {
	ElementId^ get ();
}
member IntersectedElementId : ElementId with get
Property Value
ElementId
See Also
Reference
IntersectingElementData Class
Autodesk.Revit.DB Namespace